{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "becdff1b",
   "metadata": {},
   "source": [
    "### Практические задания\n",
    "\n",
    "#### Задание 1\n",
    "\n",
    "Напишите программу, которая принимает на вход текст с клавиатуры и целое число N и выводит на экран N-граммы, входящие в этот текст, в виде кортежей, каждую на отдельной строчке.\n",
    "\n",
    "Например:\n",
    "\n",
    "Ввод:\n",
    "```\n",
    "был тихий серый вечер дул ветер слабый и тёплый\n",
    "3\n",
    "```\n",
    "Вывод:\n",
    "```\n",
    "('был', 'тихий', 'серый')\n",
    "('тихий', 'серый', 'вечер')\n",
    "('серый', 'вечер', 'дул')\n",
    "('вечер', 'дул', 'ветер')\n",
    "('дул', 'ветер', 'слабый')\n",
    "('ветер', 'слабый', 'и')\n",
    "('слабый', 'и', 'тёплый')\n",
    "```\n",
    "\n",
    "Прежде чем писать код, напишите на бумажке ответ на вопрос: сколько N-грамм можно выделить из текста длиной L? Используйте полученную формулу."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d64d3fe7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('был', 'тихий', 'серый')\n",
      "('тихий', 'серый', 'вечер')\n",
      "('серый', 'вечер', 'дул')\n",
      "('вечер', 'дул', 'ветер')\n",
      "('дул', 'ветер', 'слабый')\n",
      "('ветер', 'слабый', 'и')\n",
      "('слабый', 'и', 'тёплый')\n"
     ]
    }
   ],
   "source": [
    "text = input(\"Введите текст: \")\n",
    "ngram_order = int(input(\"Введите порядок N-граммы: \"))\n",
    "\n",
    "words = text.split()\n",
    "\n",
    "ngrams = [tuple(words[i:i + ngram_order]) for i in range(len(words) - ngram_order + 1)]\n",
    "for ng in ngrams:\n",
    "    print(ng)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7082d5c6",
   "metadata": {},
   "source": [
    "#### Задание 2\n",
    "\n",
    "Файл *anscombe.json* содержит точки из четырёх наборов данных, известных как [квартет Энскомба](https://en.wikipedia.org/wiki/Anscombe%27s_quartet). В каждом наборе у точек практически идентичные статистические свойства, однако их графики очень разные. Каждая точка закодирована в виде объекта с тремя полями: `\"Series\"` &mdash; номер набора данных римскими цифрами, `\"X\"` &mdash; абсцисса, `\"Y\"` &mdash; ордината. Убедитесь, что в каждом наборе среднее значение и стаднартное отклонение как у X, так и у Y одинаковы."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4ac942d5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "I\n",
      "9.0 7.5\n",
      "3.1622776601683795 1.9382841521679568\n",
      "\n",
      "II\n",
      "9.0 7.500909090909091\n",
      "3.1622776601683795 1.93710869148962\n",
      "\n",
      "III\n",
      "9.0 7.5\n",
      "3.1622776601683795 1.9359329439927313\n",
      "\n",
      "IV\n",
      "9.0 7.500909090909091\n",
      "3.1622776601683795 1.9360806451340837\n",
      "\n"
     ]
    }
   ],
   "source": [
    "import json\n",
    "\n",
    "with open(\"anscombe.json\") as f:\n",
    "    data = json.load(f)\n",
    "\n",
    "for num in [\"I\", \"II\", \"III\", \"IV\"]:\n",
    "    xs = [el[\"X\"] for el in data if el[\"Series\"] == num]\n",
    "    ys = [el[\"Y\"] for el in data if el[\"Series\"] == num]\n",
    "\n",
    "    mean_x = sum(xs) / len(xs)\n",
    "    mean_y = sum(ys) / len(ys)\n",
    "\n",
    "    std_x = (sum([(x - mean_x) ** 2 for x in xs]) / len(xs)) ** 0.5\n",
    "    std_y = (sum([(y - mean_y) ** 2 for y in ys]) / len(ys)) ** 0.5\n",
    "    print(num)\n",
    "    print(mean_x, mean_y)\n",
    "    print(std_x, std_y)\n",
    "    print(\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7d85b41c",
   "metadata": {},
   "source": [
    "#### Задание 3\n",
    "\n",
    "Файл `result.json` содержит информацию о постах в Telegram-канале [Открытой конференции студентов-филологов](https://t.me/oksfspbu). Откройте его в текстовом редакторе и ознакомьтесь со структурой.\n",
    "\n",
    "Найдите `id` сообщения, у которого больше всего реакций, и выведите его на экран в составе ссылки (например, t.me/oksfspbu/4).\n",
    "\n",
    "<details>\n",
    "<summary>Подсказки:</summary>\n",
    "\n",
    "1. Все сообщения хранятся в поле `\"messages\"`\n",
    "\n",
    "2. Данные о реакциях хранятся в поле `\"reactions\"`. Обратите внимание, что у некоторых сообщениях (например, служебных уведомлениях о создании канала и т.д.), этого поля нет. Вспомним, что у словарей есть метод `.get()`\n",
    "\n",
    "3. У каждой реакции есть поле `\"count\"` с данными о количестве реакций этого типа. Чтобы понять, сколько всего реакций у поста, нужно сложить эти числа для каждого словарика в поле `\"reactions\"`.\n",
    "\n",
    "4. Используйте циклы, чтобы перебирать все сообщения, а внутри каждого сообщения &mdash; все реакции.\n",
    "\n",
    "</details>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "61198b01",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "t.me/oksfspbu/83\n"
     ]
    }
   ],
   "source": [
    "with open(\"result.json\") as f:\n",
    "    data = json.load(f)\n",
    "\n",
    "messages = data[\"messages\"]\n",
    "num_reactions = [sum(x[\"count\"] for x in msg.get(\"reactions\", [])) for msg in messages]\n",
    "max_idx = num_reactions.index(max(num_reactions))\n",
    "print(f\"t.me/oksfspbu/{messages[max_idx][\"id\"]}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cec6746a",
   "metadata": {},
   "source": [
    "#### Задание 4 (*)\n",
    "\n",
    "Напишите программу, которая строит частотный словарь по постам канала. Используйте данные из поля `\"text_entities\"`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f1bbefc7",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
