export const avar_intro_text = "<div><p>Составили: студенты 4 курса кафедры фонетики и методики преподавания иностранных языков СПбГУ Морсковатых М. С. и Сиверцева Э. А. под руководством Н. Б. Вольской (2015)</p><p>Редактор: П. А. Холявин (2023, 2025)</p></div>"

export const lm_intro_text = "<div><p>Если в тексте главы не отображаются формулы, обновите страницу.</p></div>"

export const ling_programming_text = "<div><p>Методическое пособие для студентов ОП &laquo;Общая и прикладная фонетика&raquo; и &laquo;Искусственный интеллект в моделировании речевой деятельности&raquo;</p></div>"